<script setup>
import BreadCrump from '@/components/menu/BreadCrump.vue';
const breads = [
    { label: 'Home', url: '/:en', id: 1 },
    { label: "Jahon Arenasi", id: 2 },
    { label: "Osiyo olimpiya kengashi", id: 3 },
]
</script>
<template>
    <section class="committee-page">
        <div class="container">
            <BreadCrump :data="breads" />
            <h2>Osiyo olimpiya kengashi</h2>
            <a-row :gutter="[20,20]">
                <a-col :xs="24" :sm="24" :md="24" :lg="18" :xl="18">
                    <div class="committee-page__content">
                        <p>ХОҚ Миллий олимпия қўмиталари ва халқаро федерацияларини тан олиш тўғрисида қарорлар қабул
                            қилади, улар билан қалин ҳамкорлик қилади.

                            Халқаро Олимпия Қўмитасининг олий органи ХОҚ сессиясидир. У йилига бир, Олимпиадалар йилида
                            икки марта ўтказилади. Олимпия ҳаракатини ривожлантиришнинг стратегик вазифалари муҳокама
                            этиладиган ХОҚ Конгресслари, қоида бўйича, саккиз йилда бир марта ўтказилади.

                            ХОҚ сессиялари орасида Халқаро Олимпия Қўмитаси кундалик фаолиятига ХОҚ Ижроия қўмитаси
                            раҳбарлик қилади. Унинг таркиби ҳозирги пайтда 15 кишидан (ХОҚ Президенти ва тўрт нафар
                            вице-президенти, 10 нафар аъзо) иборат.

                            ХОҚнинг 1999 йил 11 — 12 декабр кунлари бўлиб ўтган 110-сессиясида қабул қилинган қарорга
                            мувофиқ, Ҳалқаро Олимпия Қўмитаси таркибида 115 нафар аъзо бўлиб, уларнинг 15 таси халқаро
                            спорт федерациялари ёки улар бирлашмалари вакилларидир, яна 15 нафари миллий олимпия
                            қўмиталари ёки уларнинг минтақавий ассоциациялари вакиллари, яна 15 таси Олимпиада
                            мусобақаларида иштирок этаётган ёки энг узоғи билан тўрт йил аввалги Олимпиада ўйинларида
                            иштирок этган спортчилар, қолган 70 нафари шахсий аъзолардан иборат бўлиши шарт. Бунда
                            ХОҚнинг шахсий аъзолари орасида ҳар бир мамлакатдан биттадан ортиқ вакил бўлиши мумкин эмас.
                            ХОҚ аъзоларининг ёши 18 ёшдан 70 ёшгача чегаралаб қўйилган. </p>
                    </div>
                </a-col>
                <a-col :xs="24" :sm="24" :md="24" :lg="6" :xl="6">
                    <div class="committee-page__sidebar">
                        <div class="committee-page__sidebar-menu">Menu</div>
                        <div class="committee-page__sidebar-img">
                            <RouterLink to="/:en">
                                <img src="@/assets/images/olimpic.png" alt="olimpic ">
                            </RouterLink>
                        </div>
                    </div>
                </a-col>
            </a-row>
        </div>
    </section>
</template>