<script setup>
import BreadCrump from '@/components/menu/BreadCrump.vue';
const breads = [
    { label: 'Home', url: '/:en', id: 1 },
    { label: "Osiyo o'yinlari", id: 2 },
    { label: "Osiyo sohilbo‘yi o‘yinlari", id: 3 },
]
</script>
<template>
    <section class="committee-page">
        <div class="container">
            <BreadCrump :data="breads" />
            <h2>Osiyo sohilbo‘yi o‘yinlari</h2>
            <a-row :gutter="[20,20]">
                <a-col :xs="24" :sm="24" :md="24" :lg="18" :xl="18">
                    <div class="committee-page__content">
                        <p>Осиё ўйинлари – 1951 йилдан бери ўтказиладиган комплекс мусобақадир. У Осиё халқлари ва
                            давлатлари бирдамлигини янада мустаҳкамлаш мақсадида ташкил қилинади. Осиё ўйинлари Халқаро
                            олимпия қўмитаси ва Осиё олимпия кенгаши байроғи остида ҳар тўрт йилда бир маротаба
                            ўтказилади.

                            Тарих

                            Осиё ўйинлари асоси сифатида Узоқ Шарқ мамлакатлари – Хитой, Япония ва Филиппин давлатлари
                            ўртасида 1913-19434 йилларда ўтказилган мусобақаларни кўрсатиш мумкин. Лондондаги XIV
                            Олимпия ўйинлари вақтида (1948 йил) Осиё мамлакатлари вакиллари Осиё ўйинлари ассоциациясини
                            ташкил этиш борасида келишувга эришадилар. У 1949 йилда Нью-Делидаги ассамблеяда кўриб
                            чиқилган ва айнан ўша ерда 1951 йилда Нью-Делида Осиё ўйинларини ўтказиш қарори қабул
                            қилинган. 1982 йилда Осиё ўйинлари федерацияси ХОҚ томонидан тан олинади. 1982 йилнинг 16
                            ноябрь куни бўлиб ўтган Бош ассамблеяда қитъанинг спорт ташкилоти ўз номини Осиё Олимпия
                            Кенгаши деб ўзгартиради.


                            Осиё ўйинлари дастури

                            Осиё ўйинлари дастуридан қуйидаги спорт турлари ўрин олган:

                            Сув спорти, камондан отиш, енгил атлетика, бадминтон, бэйсбол, баскетбол, боулинг, бокс,
                            бриж, каноэда эшкак эшиш, велоспорт, от спорти, қиличбозлик, футбол, гольф, гимнастика,
                            гандбол, чим устида хоккей, дзюдо, кабадди, каратэ, кураш, замонавий бешкураш, парашют
                            спорти, ролик спорти, академик эшкак эшиш, регби, елканли спорт, сепактакрав, ўқ отиш,
                            альпинизм, сквош, стол тенниси, таэквондо, теннис, триатлон, волейбол, оғир атлетика, спорт
                            курашлари, самбо, жуижитцу, пенчак силат, ушу.

                            Сўнгги йилларда Осиё ўйинларининг ташкилий савияси тез суратларда ошиб борди. Осиё ўйинлари
                            савиясига XXIV Олимпия ўйинлари (Сеул, 1998йил) ва XXIX Олимпия ўйинлари (Пекин, 2008йил) га
                            тайёргарлик ҳам катта таъсир кўрсатган.

                            Ўзбекистон Осиё ўйинларида 1994 йилдан буён иштирок этиб келади.

                            Айни пайтда Осиё Олимпия Кенгаши шафелигида ёзги ва қишки Олимпия ўйинларидан ташқари
                            қуйидаги мусобақалар ўтказилади:

                            -Жанг санъати ва ёпиқ иншоотлардаги Осиё ўйинлари

                            2013 йилда ёпиқ иншоотлардаги Осиё ўйинлари ва жанг санъати бўйича Осиё ўйинлари
                            мусобақалари бирлаштирилади ва Жанг санъати ва ёпиқ иншоотлардаги Осиё ўйинлари деб
                            номланади. Ўйинлар тўрт йилда бир маротаба ташкил қилинади. Мазкур мусобақада Олимпия ва
                            Осиё ўйинлари дастурига кирмаган спорт турлари бўйича ҳам мусобақалар бўлиб ўтади.

                            Мусобақада қуйидаги спорт турлари бўйича беллашувлар ўтказилади:

                            • Акробатика • аэробика • енгил атлетика • бильярд • боулинг • бриж • шахмат • велоспорт •
                            спортча рақс • «аждар ва шер рақси» мусобақаси • киберспорт • экстремал спорт турлари•
                            футзал • хоккей • сепактакрав • ролик спорти • сузиш.

                            Жанг санъати турлари:

                            • Карате • Муайтай • жиу-житсу • кикбоксинг • кураш • пенчак силат.

                            -Соҳилбўйи Осиё ўйинлари

                            -Ёшлар Осиё ўйинлари</p>
                    </div>
                </a-col>
                <a-col :xs="24" :sm="24" :md="24" :lg="6" :xl="6">
                    <div class="committee-page__sidebar">
                        <div class="committee-page__sidebar-menu">Menu</div>
                        <div class="committee-page__sidebar-img">
                            <RouterLink to="/:en">
                                <img src="@/assets/images/olimpic.png" alt="olimpic ">
                            </RouterLink>
                        </div>
                    </div>
                </a-col>
            </a-row>
        </div>
    </section>
</template>