<script setup>
import BreadCrump from '@/components/menu/BreadCrump.vue';
const breads = [
    { label: 'Home', url: '/:en', id: 1 },
    { label: "Olimpiya o'yinlari", id: 2 },
    { label: "O’yinlar tarixi", id: 3 },
]
</script>
<template>
    <section class="committee-page">
        <div class="container">
            <BreadCrump :data="breads" />
            <h2>O’yinlar tarixi</h2>
            <a-row :gutter="[20, 20]">
                <a-col :xs="24" :sm="24" :md="24" :lg="18" :xl="18">
                    <div class="committee-page__content">
                        <h5>ОЛИМПИЯ ЎЙИНЛАРИ ТАРИХИ</h5>
                        <p>Тарихга назар ташлайдиган бўлсак, биринчи Олимпия ўйинлари милоддан аввалги 776 йилда
                            ўтказилган. Мусобақалар Олимпия худоларига бағишланган ва Олимпия қишлоғи ҳудудида бўлиб
                            ўтган. Орадан деярли ўн икки аср вақт ўтгач, милодий 393 йилда император Феодосий
                            мусобақаларни бекор қилишга қарор қилган.

                            Қадимий олимпия ўйинлари Олимпия қишлоғида ўтказилган.

                            Спортчилар

                            XII аср давомида Олимпия қишлоғида жойлашган стадион ва ипподромда жуда кўплаб спортчилар
                            мусобақаларда иштирок этишган. Улар ўзларнинг ҳайратомуз натижалари орқали минглаб
                            томошабинлар олқишига сазовор бўлганлар. Олимпия ўйинлари ғолибларининг исми тарихда қолган.

                            Ушбу қадимий ўйинларда Грецияда яшовчи барча эркаклар иштирок этиши мумкин бўлган. Магара
                            Орсиплик генерал, чўпон Полимпинист, Родос Диагор қироллик оиласи вакили, Македония қироли
                            Александр I, файласуф Демокритлар шулар жумласидандир.

                            Турмуш қурган аёллар мусобақаларда томошабин сифатида ҳам иштирок эта олмаганлар. Турмушга
                            чиқмаган қизлар эса ўйинларни бевосита кузатиш имкониятига эга бўлганлар.

                            Ғолиблар мусобақалар якунланиши билан тақдирланган. Ғалаба қозонган спортчи номи эълон
                            қилинганидан сўнг Эллланодикес (юнон ҳаками) спортчига пальма япроғини тақдим этган. Ўз
                            ўрнида томошабинлар янги қаҳрамонга гуллар туҳфа этишган. Ғолибнинг боши ва қўлига қизил
                            ленталар тақишган. Бу унинг ғолиб эканлигини билдирарди.

                            Расмий тақдирлаш маросимида эса ўйинларнинг охирги куни Зевс ибодатхонасида ўтказилган.
                            Олимпия ўйинлари ғолиблари исми, отасининг исми ва туғилган жойи маълум қилинган.

                            Спорт турлари

                            Аввалига Олимпия ўйинлари бир кунда ўтказилган. Милоддан аввалги 684 йилда ўйинлар уч кунга
                            узайтирилган. V асрдан бошлаб эса беш кунга чўзилган.

                            Қадимий Олимпия ўйинлари дастурида яккакурашнинг уч ҳил тури – бокс, кураш ва панкратион
                            бўлган. Шунингдек, югуриш, узунликка сакраш, диск ва найза улоқтириш, чавандозлар беллашуви
                            ўтказилган.

                            Югуриш

                            Югуриш мусобақалари қуйидаги йўналишлар бўйича ташкил қилинган:

                            «маррагача югуриш» – стадионнинг охиридан бошлаб маълум бир масофагача югуриш (200 метр).
                            «икки марта югуриш» – спортчилар маррагача югуриб яна ортга қайтиб келишган (400 метр).
                            «узоқ масофага югуриш» – 7 босқичдан 24 босқичгача беллашувлар. Спортчилар маррани бир неча
                            марта босиб ўтадилар.

                            Бокс

                            Боксчилар бармоқларни жамлаб олиш учун (ҳозирги қўлқоплар ўрнига) махсус камарлар ўраб
                            олишган. Аввалига улар юмшоқ эди, бироқ вақт ўтгани сайин улар қаттиқлашиб борди. Рақибдан
                            зарба ўтказмай ғалаба қозона олган боксчилар алоҳида эътирофга сазовор бўлганлар. Қоидага
                            кўра, рақибни ушлаб олиш, оёғидан чалиш ва оёқда зарба бериш тақиқланган. Улар чарчаган
                            вақтида дам олиш учун вақт ҳам берилган. Дам олишдан сўнг ҳам ғолиблар аниқланмаса,
                            боксчилар бир-бирларига зарба берганлар. У вақтда рақиб ўзини ҳимоя қилмасдан турган. Ана шу
                            зарбалардан сўнг жавоб қайтара олмаган боксчи мағлубиятга учраган.

                            Кураш

                            Зарба бериш тақиқланган. Курашнинг икки йўналиши мавжуд бўлган. Беллашувлар икки ҳил
                            йўналишда олиб борилган: турган ҳолатда ва юмшоқ тупроқларда. Кураш ҳарбий тайёргарлик
                            сифатида ҳам қаралган. Жанглар спортчилардан бири мағлубиятга учраганини тан олганидан
                            сўнггина якунига етган.

                            Панкратион

                            Бокс ва кураш қоидаларини ўзида акс эттирган яккакураш тури. Панкратион қийин спорт
                            турларидан бири ҳисобланган. Спортнинг ушбу турини ўйинлар дастурига улкан шерни ер тишлата
                            олган Геракл шарафига киритишган. Қадимий юнон ёзувчиси Филострат шундай деганди:
                            «Панкратиондаги идеал жангчи бу боксчидан зўр курашадиган ва курашчидан зўр бокс тушадиган
                            спортчидир».

                            Сакраш

                            Атлетлар сакраш вақтида қўлларига тош ёки махсус нарса ушлаб олганлар. Бу орқали улар сакраш
                            масофасини янада узайтириш мумкин деб ҳисоблашган.

                            Диск улоқтириш

                            Диск улоқтириш спортнинг қадимий турларидан бири ҳисобланади. Дисклар тош ва бронзадан
                            ясалган. Вазни 2 килограммдан 6 килограммгача бўлган. Диаметри эса 21-34 сантиметрни ташкил
                            этган.</p>
                    </div>
                </a-col>
                <a-col :xs="24" :sm="24" :md="24" :lg="6" :xl="6">
                    <div class="committee-page__sidebar">
                        <div class="committee-page__sidebar-menu">Menu</div>
                        <div class="committee-page__sidebar-img">
                            <RouterLink to="/:en">
                                <img src="@/assets/images/olimpic.png" alt="olimpic ">
                            </RouterLink>
                        </div>
                    </div>
                </a-col>
            </a-row>
        </div>
    </section>
</template>